OpenNuvoton/M2354BSP/SampleCode/SecureApplication/SecureOTADemo/NuBL2/NuBL2_lib0.c
/**************************************************************************//**
 * @file     NuBL2_lib0.c
 * @version  V1.00
 * @brief    NuBL2 library source code.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2020 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"

#include "NuBL_common.h"
#include "NuBL_crypto.h"
#include "NuBL2.h"

#define printf(...)

#define DEBUG_CMD 0
void NuBL2_BytesSwap(char *buf, int32_t len);
void SetECCRegisters(int32_t i32Mode, uint32_t *pPriv, uint32_t *pPub);
void GetNuBL2AES256Key(uint32_t *key);
uint16_t cmd_CalCRC16Sum(uint32_t *pu32buf, uint32_t len);
int32_t cmd_VerifyCRC16Sum(uint32_t *pu32buf);
int32_t GenCmdSessionKey(uint32_t key[]);
int32_t IdentifyPublicKey(uint32_t *p32Buf, int32_t i32Mode);

static uint32_t IsAccessDenied(void)
{
    /* TODO:
        1. Check KPROM status (identity check then unlock KPROM protect)
        2. XOM region status
        3. Secure locked status
        4. Secuar callable only

        * Clear SRAM, crypto and others secure information
    */
    return 0;
#if 0
    if(FMC_GetXOMState(XOMR0) != 1)
    {
        NUBL_MSG("\n[XOM attributes FAIL. XOM0 is not active]\n\n");
        return (uint32_t) - 1;
    }

    if((FMC->XOMR0STS >> 8) == NUBL2_LIB_BASE)
    {
        if((FMC->XOMR0STS & 0xFF) == ((NUBL32_FW_BASE - NUBL2_LIB_BASE) / FMC_FLASH_PAGE_SIZE))
        {
            return 0;
        }
        else
        {
            NUBL_MSG("\n[XOM attributes FAIL. Invalid XOM0 region page counts]\n\n");
            return (uint32_t) - 2;
        }
    }
    else
    {
        NUBL_MSG("\n[XOM attributes FAIL. Invalid XOM0 region base address]\n\n");
        return (uint32_t) - 3;
    }
#endif
}

static void SetNuBL2PrivKey(void)
{
    //Set NuBL2 private key
    //example:
    //  const char NuBL2_priv[] = "380a67fcfc01ca7073da7c2c54296a61327f77262a7d4674c3d8e29a63e3fa20";
    //  "380a67fc-fc01ca70-73da7c2c-54296a61-327f7726-2a7d4674-c3d8e29a-63e3fa20"
    CRPT->ECC_K[0] = 0x63e3fa20;
    CRPT->ECC_K[1] = 0xc3d8e29a;
    CRPT->ECC_K[2] = 0x2a7d4674;
    CRPT->ECC_K[3] = 0x327f7726;
    CRPT->ECC_K[4] = 0x54296a61;
    CRPT->ECC_K[5] = 0x73da7c2c;
    CRPT->ECC_K[6] = 0xfc01ca70;
    CRPT->ECC_K[7] = 0x380a67fc;
}


/* __REV(x), byte swap32 */
static uint32_t NuBL_Swap32(uint32_t value)
{
    volatile uint32_t val;

    val = (value << 24) | ((value << 8) & 0xff0000) | ((value >> 8) & 0xff00) | (value >> 24);
    return val;
}

void SetECCRegisters(int32_t i32Mode, uint32_t *pPriv, uint32_t *pPub)
{
    volatile int32_t    i;
    ECC_PUBKEY_T        *pPubKey;

    if(i32Mode == 0x00020000)
    {
        pPubKey = (ECC_PUBKEY_T *)pPub;
        SetNuBL2PrivKey();
        NuBL2_BytesSwap((char*)pPubKey->au32Key0, sizeof(pPubKey->au32Key0));
        NuBL2_BytesSwap((char*)pPubKey->au32Key1, sizeof(pPubKey->au32Key1));
        for(i = 0; i < 8; i++)
            CRPT->ECC_X1[i] = pPubKey->au32Key0[i];
        for(i = 0; i < 8; i++)
            CRPT->ECC_Y1[i] = pPubKey->au32Key1[i];
    }
    if(i32Mode == 0x000F000F)
    {
        pPubKey = (ECC_PUBKEY_T *)pPub;
        for(i = 0; i < 8; i++)
            CRPT->ECC_K[i] = pPriv[i];
        for(i = 0; i < 8; i++)
            CRPT->ECC_X1[i] = pPubKey->au32Key0[i];
        for(i = 0; i < 8; i++)
            CRPT->ECC_Y1[i] = pPubKey->au32Key1[i];
    }
}

//    //iv = "1000000000000000000000000000000a"
//    //CRPT->AES0_IV[0] = 0x10000000;
//    //CRPT->AES0_IV[1] = 0x00000000;
//    //CRPT->AES0_IV[2] = 0x00000000;
//    //CRPT->AES0_IV[3] = 0x0000000a;

//    //iv = "00000000000000000000000000000000"

/* These AES256 keys are used to encrypt/decrypt Public Key Storage in ECDSA verification mode */
void GetNuBL2AES256Key(uint32_t *key)
{
    key[0] = 0x12345678;
    key[1] = 0x22222222;
    key[2] = 0x33333333;
    key[3] = 0x44444444;
    key[4] = 0x55555555;
    key[5] = 0x66666666;
    key[6] = 0x77777777;
    key[7] = 0x89abcdef;
}


/**
  * @brief      Perform NuBL2 to verify NuBL32 or NuBL33 F/W
  * @param[in]  mode        bit-0: 0:verify NuBL32; 1:verify NuBL33 \n
  *                         bit-4: 0:Integrity check; 1:Identify check
  * @retval     0           Success
  * @retval     others      Failed
  * @details    This function is used to perform identify, authenticate and verify F/W integrity of NuBL32 or NuBL33. \n
  *             Flow: \n
  *                 1. Decrypt(use NuBL2 AES key) Key Storage to get NuBL32x public key \n
  *                 2. Decrypt(use NuBL2&NuBL3x ECDH key) NuBL3x info \n
  *                 3. Identify NuBL3x public key \n
  *                 4. Authenticate NuBL3x info Hash \n
  *                 5. Verify NuBL3x F/W Hash \n
  */
int32_t NuBL2_ExecuteVerifyNuBL3x(uint32_t *buf, int32_t mode)
{
    volatile int32_t    ret = -1000;
    uint32_t            *keybuf, *infobuf, base, len, start, end, u32FwInfoAddr, u32PubKeyAddr;
    ECC_PUBKEY_T        PubKey;
    FW_INFO_T           FwInfo;
    uint32_t            AESkey[8], Hash[8], HashValue[8];
    volatile uint32_t    i;

    if(!((mode == 0) || (mode == 1) || (mode == 0x10) || (mode == 0x11)))
    {
        NUBL_MSG("\nNuBL2 verify NuBL3x FAIL. Invalid mode: 0x%x.\n\n", mode);
        return ret;
    }

    if((ret = (int32_t)IsAccessDenied()) != 0)
        return ret;

    NUBL_MSG("\nNuBL2 verify NuBL3%d. \n\n", ((mode & BIT0) == 0) ? 2 : 3);

    memset(&AESkey, 0x0, sizeof(AESkey));
    memset(&PubKey, 0x0, sizeof(ECC_PUBKEY_T));
    memset(&FwInfo, 0x0, sizeof(FW_INFO_T));

    if(buf == NULL)
    {
        u32FwInfoAddr = (uint32_t)&FwInfo;
        infobuf = (uint32_t *)u32FwInfoAddr;
        //infobuf = (uint32_t *)&FwInfo;
    }
    else
        infobuf = buf;

    /* Check NuBL3x Key Storage Hash */
    /* Get encrypted NuBL3x public key from Key Storage */
    len = sizeof(ECC_PUBKEY_T);
    if((((uint32_t)mode)&BIT0) == 0)
    {
        extern uint32_t g_NuBL32EnCryptPubKeyBase;  /* declared in LoadKeyStorage.s */
        base = (uint32_t)&g_NuBL32EnCryptPubKeyBase;  /* encrypted NuBL32 pub key address */
    }
    else
    {
        extern uint32_t g_NuBL33EnCryptPubKeyBase;  /* declared in LoadKeyStorage.s */
        base = (uint32_t)&g_NuBL33EnCryptPubKeyBase;  /* encrypted NuBL33 pub key address */
    }
    u32PubKeyAddr = (uint32_t)&PubKey;
    keybuf = (uint32_t *)u32PubKeyAddr;
    for(i = 0; i < (len / 4); i++)
        keybuf[i] = inpw(base + (i * 4));

    start = (uint32_t)&PubKey;
    end   = (uint32_t)&PubKey + len;
    NuBL_CalculateSHA256(start, end, (uint32_t *)Hash, SHA_ONESHOT, SHA_SRC_SRAM);

    /* Get encrypted NuBL3x public key from Key Storage Hash base */
    len = sizeof(ECC_PUBKEY_T);
    if((((uint32_t)mode)&BIT0) == 0)
    {
        extern uint32_t g_NuBL32EnCryptPubKeyHashBase;  /* declared in LoadKeyStorage.s */
        base = (uint32_t)&g_NuBL32EnCryptPubKeyHashBase;  /* encrypted NuBL32 pub key hash address */
    }
    else
    {
        extern uint32_t g_NuBL33EnCryptPubKeyHashBase;  /* declared in LoadKeyStorage.s */
        base = (uint32_t)&g_NuBL33EnCryptPubKeyHashBase;  /* encrypted NuBL33 pub key hash address */
    }
    start = base;
    end   = base + sizeof(Hash);
    keybuf = (uint32_t *)&HashValue;
    for(i = 0; i < (sizeof(HashValue) / 4); i++)
        keybuf[i] = inpw(base + (i * 4));

    if(memcmp(&Hash[0], &HashValue[0], (HASH_SIZE / 8)) != 0)
    {
        uint32_t *tmp;
        tmp = (uint32_t *)&Hash;
        NUBL_MSG("Verify NuBL3%d F/W Hash [FAIL]\n\n", ((mode & BIT0) == 0) ? 2 : 3);
        NUBL_MSG("F/W Hash:\n");
        for(i = 0; i < ((HASH_SIZE / 8) / 4); i++)
            NUBL_MSG("\t%d: 0x%08x - 0x%08x.\n", i, Hash[i], HashValue[i]);
        ret = -5001;
        goto _exit_NuBL2_ExecuteVerifyNuBL3x;
    }
    NUBL_MSG("Verify NuBL3%d Key Storage Hash [PASS]\n\n", ((mode & BIT0) == 0) ? 2 : 3);

    /* Step 1. Decrypt NuBL3x public key */
    /* Get AES256key for follows AES decryption */
    GetNuBL2AES256Key(AESkey);
    NUBL_MSG("AES256 decryption keys:\n");
    for(i = 0; i < 8; i++)
        NUBL_MSG("\t0x%08x.\n", AESkey[i]);

    /* Get encrypted NuBL3x public key from Key Storage */
    len = sizeof(ECC_PUBKEY_T);
    if((((uint32_t)mode)&BIT0) == 0)
    {
        extern uint32_t g_NuBL32EnCryptPubKeyBase;  /* declared in LoadKeyStorage.s */
        base = (uint32_t)&g_NuBL32EnCryptPubKeyBase;  /* encrypted NuBL32 pub key address */
    }
    else
    {
        extern uint32_t g_NuBL33EnCryptPubKeyBase;  /* declared in LoadKeyStorage.s */
        base = (uint32_t)&g_NuBL33EnCryptPubKeyBase;  /* encrypted NuBL33 pub key address */
    }
    keybuf = (uint32_t *)u32PubKeyAddr;
    for(i = 0; i < (len / 4); i++)
        keybuf[i] = inpw(base + (i * 4));

    /* Trigger decryption... */
    if(NuBL_AES256Decrypt(keybuf, keybuf, len, AESkey) != 0)
    {
        ret = -1003;
        goto _exit_NuBL2_ExecuteVerifyNuBL3x;
    }
    NUBL_MSG("Decrypt NuBL3%d public key [Done]\n\n", ((mode & BIT0) == 0) ? 2 : 3);


    /* Step 2. Decrypt or get NuBL3x info */
    /* Get NuBL3x F/W info */
    len = sizeof(FW_INFO_T);
    if((((uint32_t)mode)&BIT4) != BIT4)
    {
        if((((uint32_t)mode)&BIT0) == 0)
            base = NUBL32_FW_INFO_BASE;   // NuBL32 F/W info address
        else
            base = NUBL33_FW_INFO_BASE;   // NuBL33 F/W info address
        for(i = 0; i < (len / 4); i++)
            infobuf[i] = inpw(base + (i * 4));
    }
    NUBL_MSG("Get NuBL3%d F/W info [Done]\n\n", ((mode & BIT0) == 0) ? 2 : 3);


    /* Step 3. Identify NuBL3x public key (encloed in Key Storage and F/W info) */
    memcpy(&FwInfo, infobuf, sizeof(FW_INFO_T));
#if defined(DIRECT_VERIFY_NUBL3x_PUBKEY)
    if(memcmp(&PubKey.au32Key0[0], &FwInfo.pubkey.au32Key0[0], sizeof(ECC_PUBKEY_T)) != 0)
    {
        NUBL_MSG("Identify NuBL3%d public key [FAIL]\n\n", ((mode & BIT0) == 0) ? 2 : 3);
        ret = -3001;
        goto _exit_NuBL2_ExecuteVerifyNuBL3x;
    }
#else
    start = (uint32_t)&PubKey.au32Key0[0];
    end   = start + sizeof(ECC_PUBKEY_T) / 2;
    NuBL_CalculateSHA256(start, end, (uint32_t *)Hash, SHA_ONESHOT, SHA_SRC_SRAM);
    if(memcmp((uint32_t *)Hash, &FwInfo.pubkey.au32Key0[0], sizeof(Hash)) != 0)
    {
        NUBL_MSG("Identify NuBL3%d public key [FAIL]\n\n", ((mode & BIT0) == 0) ? 2 : 3);
        ret = -3001;
        goto _exit_NuBL2_ExecuteVerifyNuBL3x;
    }
    start = (uint32_t)&PubKey.au32Key1[0];
    end   = start + sizeof(ECC_PUBKEY_T) / 2;
    NuBL_CalculateSHA256(start, end, (uint32_t *)Hash, SHA_ONESHOT, SHA_SRC_SRAM);
    if(memcmp((uint32_t *)Hash, &FwInfo.pubkey.au32Key1[0], sizeof(Hash)) != 0)
    {
        NUBL_MSG("Identify NuBL3%d public key [FAIL]\n\n", ((mode & BIT0) == 0) ? 2 : 3);
        ret = -3001;
        goto _exit_NuBL2_ExecuteVerifyNuBL3x;
    }
#endif
    NUBL_MSG("Identify NuBL3%d public key [PASS]\n\n", ((mode & BIT0) == 0) ? 2 : 3);


